tutorials/cylinder/openHFDIBRANS/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceThreshold    1e-4;
sdBasedLambda       false;
stlName             cylinder;
interfaceSpan       1.0;
saveIntInfo         true;
scaleDisG           true;
scaleCoeff          1.0;

surfAreaType        cutEdges;

wallFunctions
{
	nut		nutkWallFunction;
	k		kLowReWallFunction;
	omega	omegaWallFunction;
	epsilon	epsilonWallFunction;
}

forceCoeffs 
{
    rhoInf      1000.0;
    dragDir     (1 0 0);
    liftDir     (0 1 0);
    magUInf     0.5;
    ARef        2e-05;
}

// ************************************************************************* //
